000001 IDENTIFICATION DIVISION.  
000002     PROGRAM-ID. COMOVAI.
000003     AUTHOR. Kenzo.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 
       01  NOME PIC A(020).
       
       01  DATA-ATUAL.
           05 ANO-ATUAL PIC 9(004).
           05 MES-ATUAL PIC 9(004).
           05 DIA-ATUAL PIC 9(004).

000009 PROCEDURE DIVISION.
000010 PRINCIPAL.
000011     DISPLAY "Entre com seu nome: ".
           ACCEPT NOME.
           ACCEPT DATA-ATUAL FROM DATE YYYYMMDD.
           DISPLAY "Bem vindo " NOME.
           DISPLAY "Sabia que hoje é " DIA-ATUAL "/" MES-ATUAL "/" 
           ANO-ATUAL "?".
000012     
000013 STOP RUN.
000014 END PROGRAM COMOVAI.
