000001 IDENTIFICATION DIVISION.  
000002     PROGRAM-ID. IMC.
000003     AUTHOR. Kenzo.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 
000010     01 ALTURA PIC 9V99.
000011     01 PESO PIC 999.
000012     01 IMC_TOTAL PIC ZZ9.99.
000013           01 NOME PIC A(020).
000014
000015 PROCEDURE DIVISION.
000016 PRINCIPAL.
000017     DISPLAY "Entre com seu nome: ".
000018           ACCEPT NOME.
000019    DISPLAY "Entre com sua altura (Em metros): ".
000020           ACCEPT ALTURA.
000021     DISPLAY "Entre com seu peso (Em kilos): ".
000022           ACCEPT PESO.
000023     
000024     COMPUTE IMC_TOTAL = PESO / (ALTURA ** 2).
000025
000026     DISPLAY NOME "Seu IMC é: " IMC_TOTAL.
000027     
000028 STOP RUN.
000029 END PROGRAM IMC.
